# RbsParallelconduitsHorizontalNumber Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsParallelconduitsHorizontalNumber Property
ParameterTypeId Class See Also
---
"Horizontal Number for parallel conduits"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsParallelconduitsHorizontalNumber { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsParallelconduitsHorizontalNumber As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsParallelconduitsHorizontalNumber {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace